In [1]:
import pandas as pd

In [2]:
# Create df1
df1 = pd.DataFrame({
    'month': ['January', 'February', 'March', 'April'],
    'year': [2023, 2023, 2023, 2023],
    'sales': [200, 250, 300, 400]
})

# Create df2
df2 = pd.DataFrame({
    'month': ['January', 'March', 'April', 'May'],
    'year': [2023, 2023, 2023, 2023],
    'profit': [50, 70, 90, 110]
})

In [3]:
df1

      month  year  sales
0   January  2023    200
1  February  2023    250
2     March  2023    300
3     April  2023    400

In [4]:
df2

     month  year  profit
0  January  2023      50
1    March  2023      70
2    April  2023      90
3      May  2023     110

In [25]:
result_merge = df1.merge(df2, how='inner', on=['month', 'year'])

result_merge

     month  year  sales  profit
0  January  2023    200      50
1    March  2023    300      70
2    April  2023    400      90

In [12]:
result_concat = pd.concat([df1, df2.drop(['month','year'], axis=1)],axis=1)

result_concat

      month  year  sales  profit
0   January  2023    200      50
1  February  2023    250      70
2     March  2023    300      90
3     April  2023    400     110

In [17]:
result_join = df1.set_index(['month', 'year']).join(
    df2.set_index(['month', 'year']), 
    how='inner'
)

result_join

              sales  profit
month   year
January 2023    200      50
March   2023    300      70
April   2023    400      90

In [21]:
df3 = pd.DataFrame({
    'key': ['Jan', 'Feb'],
    'A': [1, 2]
})

df4 = pd.DataFrame({
    'key': ['Jan', 'Mar'],
    'B': [10, 20]
})

In [27]:
result_join1=df3.set_index('key').join(df4.set_index('key'),how='outer')
result_join1

       A     B
key
Feb  2.0   NaN
Jan  1.0  10.0
Mar  NaN  20.0

In [31]:
print(result_join1)

result_join1[['A', 'B']]

       A     B
key
Feb  2.0   NaN
Jan  1.0  10.0
Mar  NaN  20.0

       A     B
key
Feb  2.0   NaN
Jan  1.0  10.0
Mar  NaN  20.0

In [33]:
print(result_merge)

result_int = result_merge.select_dtypes(include=['int64'])

result_int

     month  year  sales  profit
0  January  2023    200      50
1    March  2023    300      70
2    April  2023    400      90

   year  sales  profit
0  2023    200      50
1  2023    300      70
2  2023    400      90

In [34]:
print(result_merge)

result_merge[result_merge['month']=='January']

     month  year  sales  profit
0  January  2023    200      50
1    March  2023    300      70
2    April  2023    400      90

     month  year  sales  profit
0  January  2023    200      50

In [35]:
df5= pd.DataFrame({
    'month': ['January', 'February', 'March', 'April'],
    'year': [2023, 2023, 2023, 2023],
    'sales': [250,200 ,400, 300 ]
})

In [37]:
print(df5)

df5.sort_values(by=['sales'], ascending=False)

      month  year  sales
0   January  2023    250
1  February  2023    200
2     March  2023    400
3     April  2023    300

      month  year  sales
2     March  2023    400
3     April  2023    300
0   January  2023    250
1  February  2023    200

In [39]:
df5.iloc[1:3, 2:]

      month  year  sales
1  February  2023    200
2     March  2023    400

In [40]:
df5.iloc[1:3]

      month  year  sales
1  February  2023    200
2     March  2023    400

In [46]:
df5.iloc[1, 1]

np.int64(2023)

In [45]:
print(df5.iloc[1, 1])

2023

In [48]:
df5.iloc[[0, 2], [1, 2]]

   year  sales
0  2023    250
2  2023    400

In [50]:
print(df5)

df5.loc[:, ['year', 'sales']]

      month  year  sales
0   January  2023    250
1  February  2023    200
2     March  2023    400
3     April  2023    300

   year  sales
0  2023    250
1  2023    200
2  2023    400
3  2023    300

: